# DocumentValidation Methods

---
The DocumentValidation type exposes the following members.
| Name| Description
---|---|---
| CanDeleteElement|  Indicates if an element can be deleted.
Top
#### Reference
DocumentValidation Class
Autodesk.Revit.DB Namespace